{
  "chapter": "Communication",
  "explanations": {
    "05COM01": {
      "explanation": "On the A220, VHF 3 radio can be operated in both voice and data modes. This dual-mode capability allows the aircraft to use VHF 3 for either voice communications with ATC or for VHF Data Link (VDL) communications when needed. The ability to switch between voice and data modes provides operational flexibility, allowing the crew to dedicate radios as needed for different communication requirements during flight.",
      "source": "FCOM1 - Operations Manual Part B",
      "page": "23-11-00",
      "correctAnswer": "a"
    },
    "05COM02": {
      "explanation": "The open microphone protection function prevents stuck or inadvertently held push-to-talk switches from blocking frequencies indefinitely. For VHF radios (the most commonly used for ATC communication), transmission is automatically terminated after 30 seconds of continuous transmission. For HF radios, SATCOM, cabin intercom, and passenger address systems, the timeout is longer at 2 minutes since these systems are typically used for longer communications such as position reports or passenger announcements.",
      "source": "FCOM1",
      "page": "23-11-00",
      "correctAnswer": "a, d"
    },
    "05COM03": {
      "explanation": "When an audio knob on the audio control panel is unlatched (pulled out to the raised position), two things happen: the audio source becomes active and can be heard through the headset or speaker, and the volume can be adjusted by rotating the knob. This design allows pilots to quickly enable/disable audio sources and adjust their volume. The unlatched position indicates that the audio source is selected and active.",
      "source": "FCOM1",
      "page": "23-13-00",
      "correctAnswer": "b, d"
    },
    "05COM04": {
      "explanation": "After 30 seconds of continuous VHF transmission, the open microphone protection function automatically terminates the transmission to prevent blocking the frequency indefinitely due to a stuck or held push-to-talk switch. Two beeps sound to alert the crew that the transmission has been automatically terminated. This protection prevents continuous frequency blocking which could interfere with ATC communications and is a critical safety feature for maintaining clear airways communications.",
      "source": "FCOM1",
      "page": "23-11-00",
      "correctAnswer": "c"
    },
    "05COM05": {
      "explanation": "The default page on the CTP (Control Tuning Panel) is the VHF radio tuning page, displaying the active and standby frequencies for VHF 1 and VHF 2 radios. This is the primary communication system used by pilots, so it makes sense for it to be the default display upon power-up. The default page provides immediate access to the most frequently used communication frequencies without requiring the crew to navigate through menu pages.",
      "source": "FCOM1",
      "page": "23-12-00",
      "correctAnswer": "d"
    },
    "05COM06": {
      "explanation": "The HF CONTROL window is accessed through the CNS (Communication and Navigation System) page by selecting the HF1 or HF2 soft key. This provides access to HF radio controls and settings including frequency tuning, mode selection (USB/LSB), and other HF-specific functions. The CNS page serves as a central access point for communication and navigation system controls on the A220.",
      "source": "FCOM1",
      "page": "23-11-00",
      "correctAnswer": "a"
    },
    "05COM07": {
      "explanation": "When the 1/2 function key on the control tuning panel (CTP) is pressed once, it enables tuning of the cross-side radios. This allows the pilot on one side to tune radios normally controlled by the pilot on the other side. Pressing the 1/2 key toggles between controlling own-side radios and cross-side radios, providing flexibility in crew workload distribution and ensuring either pilot can access all radio controls when needed.",
      "source": "FCOM1",
      "page": "23-12-00",
      "correctAnswer": "a"
    },
    "05COM08": {
      "explanation": "The VHF CONTROL page on the CTP is accessed by pressing twice on the Line Select Key (LSK) adjacent to the active frequency. The first press typically selects the frequency field, and the second press accesses the VHF CONTROL page where settings like squelch level can be adjusted. This is a common interface design pattern on modern avionics that prevents accidental access while keeping the function readily available.",
      "source": "FCOM1",
      "page": "23-12-00",
      "correctAnswer": "c"
    },
    "05COM09": {
      "explanation": "The FMS graphical radio tuning function allows automatic tuning of VHF COM radios by selecting airports or air route traffic control centers (ARTCC) from the navigation database. When a pilot selects an airport or ARTCC on the FMS display, the system can automatically load the associated frequencies into the VHF radio standby frequency. This reduces pilot workload, prevents frequency entry errors, and improves efficiency during high-workload phases of flight.",
      "source": "FCOM1",
      "page": "23-12-00",
      "correctAnswer": "a"
    },
    "05COM10": {
      "explanation": "Based on the CTP display image, the squelch level selected is SQ3. Squelch levels typically range from SQ1 (lowest, most sensitive) to SQ3 (highest, least sensitive). SQ3 filters out more background noise and weak signals, only allowing stronger signals to be heard. This setting is useful in high-noise environments or when strong signals are expected, helping reduce cockpit noise and improve clarity of communications.",
      "source": "FCOM1",
      "page": "23-12-00",
      "correctAnswer": "a"
    },
    "05COM11": {
      "explanation": "Radio control and tuning on the A220 is accomplished through three methods: Graphical tuning (using the FMS to select frequencies from the navigation database based on airports or waypoints), Control Tuning Panels (CTPs) which are dedicated physical interfaces for radio management, and Display tuning (using the multifunction displays with line select keys to tune radios). This triple-redundant approach provides flexibility and ensures radio control capability even if one method fails.",
      "source": "FCOM1",
      "page": "23-12-00",
      "correctAnswer": "a, c, d"
    },
    "05COM12": {
      "explanation": "The Control Tuning Panel (CTP) uses 3 pages to provide tuning functions for all the radios. These pages typically include: Page 1 for VHF1 and VHF2 radios, Page 2 for VHF3 and navigation radios, and Page 3 for HF and other communication systems. This multi-page design allows access to all radio systems through a single CTP interface while keeping each page uncluttered and easy to use.",
      "source": "FCOM1",
      "page": "23-12-00",
      "correctAnswer": "c"
    },
    "05COM13": {
      "explanation": "The green READY communication flag on the EICAS is a signal from the cabin crew to the flight crew indicating that the cabin is secure and ready for takeoff or landing. This includes confirmation that passengers are seated, seatbelts are fastened, cabin doors are armed, tray tables and seat backs are in their upright positions, and all cabin safety requirements are met. This is a standard communication procedure between cabin crew and flight crew that ensures safe departure or arrival.",
      "source": "FCOM1",
      "page": "23-13-00",
      "correctAnswer": "a"
    },
    "05COM14": {
      "explanation": "The MECH CALL pushbutton allows the flight crew to call ground maintenance personnel. When pressed, it activates a horn that sounds in the nose landing gear service area where maintenance personnel typically work during ground servicing and pre-flight checks. This provides a way for the crew to get the attention of ground crew without using the intercom, leaving the flight deck, or relying on hand signals.",
      "source": "FCOM1",
      "page": "23-13-00",
      "correctAnswer": "b"
    },
    "05COM15": {
      "explanation": "To initiate an emergency cabin call from the flight deck to the cabin crew, the pilot must press and hold the CAB (cabin) transmit pushbutton for more than 3 seconds. This deliberate action (requiring more than 3 seconds of continuous pressing) prevents accidental emergency calls while ensuring a quick and standardized way to alert cabin crew in true emergencies. The extended press time distinguishes emergency calls from normal cabin calls and triggers special alerting in the cabin.",
      "source": "FCOM1",
      "page": "23-13-00",
      "correctAnswer": "c"
    },
    "05COM16": {
      "explanation": "When the cabin crew initiates a priority cabin call, multiple indications alert the flight crew to ensure the call is not missed: The CALL legend flashes on the CAB (cabin) transmit pushbutton providing a visual indication at the control location, an aural tone sounds to ensure immediate attention even if the crew is not looking at the panels, and a yellow CABIN communication flag flashes on the EICAS, providing a persistent visual alert on the primary flight display. This multi-modal alerting ensures urgent cabin communications receive immediate attention.",
      "source": "FCOM1",
      "page": "23-13-00",
      "correctAnswer": "a, b, d"
    },
    "05COM17": {
      "explanation": "The data link communication system provides two-way digital communication between the aircraft and the ACARS (Aircraft Communications Addressing and Reporting System) network. This allows for the exchange of text messages, weather data, flight plans, clearances, maintenance data, and other operational information between the aircraft and airline operations, ATC, and other ground-based services. The system operates automatically in the background over VHF Data Link (VDL) and/or SATCOM.",
      "source": "FCOM1",
      "page": "23-14-00",
      "correctAnswer": "b"
    },
    "05COM18": {
      "explanation": "The ATS MENU page displays air traffic service functions including Departure and oceanic clearances (pre-departure clearances, PDC, and oceanic route clearances received via datalink) and ATIS (Automatic Terminal Information Service) and TWIP (Terminal Weather Information for Pilots). These are the primary ATS datalink services used for routine flight operations, reducing voice communication workload and potential for miscommunication while providing text-based clearances and weather information.",
      "source": "FCOM1",
      "page": "23-14-00",
      "correctAnswer": "a, c"
    },
    "05COM19": {
      "explanation": "The datalink communication system uses two primary transmission systems: VHF Data Link (VDL), which provides line-of-sight data communication with ground stations (typically up to 200-250 nautical miles), and Satellite Communications (SATCOM), which provides beyond line-of-sight global coverage including oceanic and remote areas. The system can automatically switch between these transmission methods based on availability and signal strength to maintain continuous datalink connectivity.",
      "source": "FCOM1",
      "page": "23-14-00",
      "correctAnswer": "b, c"
    },
    "05COM20": {
      "explanation": "When a new datalink message is received, multiple alerts notify the crew to ensure messages are not missed: A 'DATALINK RECV' advisory message displays on EICAS to provide a visual alert on the primary flight display, the DLK (datalink) page soft key on the bottom right becomes active (often with an indication showing unread messages) allowing immediate access to the message, and an aural tone sounds to ensure the crew is aware even if not looking at the displays. This multi-sensory alerting ensures important operational messages receive prompt attention.",
      "source": "FCOM1",
      "page": "23-14-00",
      "correctAnswer": "a, b, d"
    },
    "05COM21": {
      "explanation": "The selected communication radio volume can be adjusted without unlatching the knob. This allows pilots to quickly adjust the volume of the actively selected COM radio (the one they are currently using for transmission and reception) without having to unlatch the knob first. This design provides quick access to the most frequently adjusted audio control while preventing inadvertent changes to other audio sources by requiring those knobs to be unlatched before adjustment.",
      "source": "FCOM1",
      "page": "23-13-00",
      "correctAnswer": "c"
    },
    "05COM22": {
      "explanation": "The A220 provides three comprehensive methods for radio control and tuning: Control Tuning Panels (CTPs) which are dedicated physical panels with integrated displays for direct radio control, Display Tuning through the multifunction displays using line select keys and on-screen controls, and Graphical Tuning through the FMS which can automatically tune frequencies based on flight plan waypoints, airports, or ARTCCs selected on the navigation display. This redundancy and flexibility allows pilots to use the most convenient and efficient method for the current situation.",
      "source": "FCOM1",
      "page": "23-12-00",
      "correctAnswer": "d"
    },
    "05COM23": {
      "explanation": "The VHF CONTROL page allows pilots to adjust the squelch level for VHF radios. Squelch control helps filter out background noise and interference, only allowing signals above a certain strength threshold to be heard. Adjustable squelch levels (typically SQ1, SQ2, SQ3) allow pilots to optimize reception based on signal conditions - using lower squelch in areas with weak signals and higher squelch in high-noise environments to reduce cockpit audio clutter.",
      "source": "FCOM1",
      "page": "23-12-00",
      "correctAnswer": "b"
    },
    "05COM24": {
      "explanation": "Based on the CTP display image, the transmission mode selected is UV (Upper sideband Voice). This is the standard mode for VHF voice communications. The UV mode indication shows that the radio is configured for normal voice communications rather than data mode or other specialized transmission modes. On modern avionics, the transmission mode is clearly displayed to ensure pilots are aware of the current radio configuration.",
      "source": "FCOM1",
      "page": "23-12-00",
      "correctAnswer": "d"
    }
  }
}
